# SlantedColumnEndCutPlaneIsParallelToGeometry Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..SlantedColumnEndCutPlaneIsParallelToGeometry Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Cut plane of slanted column end is parallel to the location curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlantedColumnEndCutPlaneIsParallelToGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlantedColumnEndCutPlaneIsParallelToGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlantedColumnEndCutPlaneIsParallelToGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace